c5/src/DataProcessors/UpdateInfobase/UpdateInfobase.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>UpdateInfobase</name>
</mdclass:DataProcessor>

c5/src/InformationRegisters/Forms/Forms.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Forms</name>
  <resources>
    <name>Form</name>
    <type>
      <types>DefinedType.FormType</types>
    </type>
  </resources>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.FormStatuses</types>
    </type>
  </attributes>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DefinedType.FormDocument</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Catalogs/Reports/Reports.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Reports</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Calculated</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>DateStart</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Exporter</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>FinancialPeriod</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HasExport</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Master</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>MasterReport</name>
    <type>
      <types>CatalogRef.Reports</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Period</name>
    <type>
      <types>EnumRef.Periods</types>
    </type>
  </attributes>
  <attributes>
    <name>Program</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Template</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

c5/src/DataProcessors/UpdateInfobase/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

var Parameters export;
var JobKey export;
var SessionTenant;
var Tenants;
var Release;
var Files;
var Config;
var Remove;
//@skip-warning
var Update;
var ReportsList;
var Template;
var Program;
var Exporter;
var Company;
var User;

Procedure Exec () export
	
	rememberSession ();
	Tenants = getTenants ();
	releases = DataProcessors.UpdateInfobase.GetReleases ();
	error = undefined;
	for i = lastUpdate ( releases ) to releases.Ubound () do
		Release = releases [ i ];
		try
			run ();
		except
			error = ErrorDescription ();
			break;
		endtry;
		commit ();
	enddo;
	if ( error = undefined ) then
		restoreSession ();
	else
		processError ( error );
	endif;
	stopUpdating ();
	
EndProcedure

Procedure rememberSession ()
	
	SessionTenant = SessionParameters.Tenant;
	
EndProcedure

Function getTenants ()
	
	s = "
	|select Tenants.Ref as Ref
	|from Catalog.Tenants as Tenants
	|where not Tenants.DeletionMark
	|and not Tenants.Deactivated
	|";
	q = new Query ( s );
	return q.Execute ().Unload ().UnloadColumn ( "Ref" );
	
EndFunction

Function lastUpdate ( Releases )
	
	myVersion = DataProcessors.UpdateInfobase.MyVersion ();
	i = releases.Count ();
	while ( i > 0 ) do
		i = i - 1;
		Release = Releases [ i ];
		if ( Release.Version <= myVersion ) then
			return i + 1;
		elsif ( Release.Intermediate ) then
			return i;
		endif;
	enddo;
	return 0;
	
EndFunction

Procedure run ()
	
	call = "_" + StrReplace ( Release.Release, ".", "_" ) + "();";
	execute ( call );
	
EndProcedure

Procedure restoreSession ()
	
	activateTenant ( SessionTenant );
	
EndProcedure

Procedure processError ( Error )
	
	while ( TransactionActive () ) do
		RollbackTransaction ();
	enddo;
	restoreSession ();
	Progress.Put ( Output.UpdateError () + ":" + Chars.LF + Error, JobKey, true );
	
EndProcedure

Procedure commit ()
	
	Constants.Release.Set ( Release.Release );
	
EndProcedure

Procedure activateTenant ( Tenant )
	
	SessionParameters.Tenant = Tenant;
	SessionParameters.TenantUse = true;
	
EndProcedure

Procedure stopUpdating ()
	
	Constants.Updating.Set ( false );
	
EndProcedure

#region Releases

Procedure _1_0_0_1 () export
	
	// Consider the following code as template of update procedure
	BeginTransaction ();
	for each tenant in Tenants do
		activateTenant ( tenant );
		// Do your update...
		// Update reports if required
		updateReports ();
	enddo;
	CommitTransaction ();
	
EndProcedure

Procedure _5_0_25_1 () export
	
	BeginTransaction ();
	for each tenant in Tenants do
		activateTenant ( tenant );
		setTaxNumbers ();
		//updateReports ();
	enddo;
	CommitTransaction ();
	
EndProcedure

Procedure setTaxNumbers ()
	
	q = new Query ( "
	|select Forms.Document as Document, Forms.Form as Form, Forms.Status as Status,
	|	Forms.Form.Number as Number
	|from InformationRegister.Forms as Forms" );
	r = InformationRegisters.Forms.CreateRecordSet ();
	r.Load ( q.Execute ().Unload () );
	r.Write ();

EndProcedure

#endregion

Procedure updateReports ()

	readData ();
	getReportsList ();
	runUpdateReports ();
	
EndProcedure

Procedure readData () 

	folder = TempFilesDir ();
	fileName = folder + new UUID + ".zip";
	t = GetTemplate ( "Reports_" + StrReplace ( Release.Release, ".", "_" ) );
	t.Write ( fileName );
    zip = new ZipFileReader ();
	zip.Open ( fileName );
	for each item in zip.Items do
		zip.Extract ( item, folder );
		extension = item.Extension;
		fileName = folder + item.FullName;
		if ( extension = "json" ) then
			Config = Conversion.FromJSON ( getText ( fileName ) );
			continue;
		endif;	
		if ( extension = "mxl" ) then
			data = new SpreadsheetDocument ();
			data.Read ( fileName );	
			id = item.BaseName;
			type = Template;
		else
			data = getText ( fileName );
			baseName = item.BaseName;
			if ( StrFind ( baseName, ".module" ) > 0 ) then
				id = StrReplace ( baseName, ".module", "" );
				type = Program;
			else
				id = StrReplace ( baseName, ".export", "" );
				type = Exporter;
			endif;
		endif;
		row = Files.Add ();
		row.ID = id;
		row.Type = type;
		row.Data = data;
	enddo;
	zip.Close ();

EndProcedure

Function getText ( FileName ) 

	text = new TextDocument ();
	text.Read ( FileName );	
	return text.GetText ();

EndFunction

Procedure getReportsList () 

	s = "
	|select Reports.Ref as Ref, Reports.Name as ID
	|from Catalog.Reports as Reports
	|where not Reports.DeletionMark
	|and Reports.Master
	|and Reports.Name in ( &IDs )
	|";
	q = new Query ( s );
	ids = new Array ();
	for each row in Config do
		ids.Add ( row.ID );	
	enddo;
	q.SetParameter ( "IDs", ids );
	ReportsList = q.Execute ().Unload ();
	ReportsList.Indexes.Add ( "ID" );

EndProcedure

Procedure runUpdateReports () 

	reportsManager = Catalogs.Reports;
	filter = new Structure ( "ID" );
	for each row in Config do
		id = row.ID;
		rowList = ReportsList.Find ( id, "ID" );
		if ( rowList = undefined ) then
			ref = undefined;
		else
			ref = rowList.Ref;
		endif;
		if ( row.Action = Remove ) then
			if ( ref = undefined ) then
				continue;
			endif;
			object = ref.GetObject ();
			object.Delete ();
		else
			if ( ref = undefined ) then
				object = reportsManager.CreateItem ();
			else
				object = ref.GetObject ();	
			endif;
			filter.ID = id;
			updateReport ( row, object, Files.FindRows ( filter ) );
		endif;
	enddo;

EndProcedure

Procedure updateReport ( RowConfig, Object, FilesRows ) 

	for each file in FilesRows do
		type = file.Type;
		data = file.Data;
		if ( type = Template ) then
			Object.Template = new ValueStorage ( data );
		elsif (type = Program ) then
			Object.Program = new ValueStorage ( data );
		else
			if ( data = "" ) then
				Object.HasExport = false;
				Object.Exporter = undefined;
			else
				Object.HasExport = true;
				Object.Exporter = new ValueStorage ( data );
			endif;
		endif;
	enddo;
	Object.Period = Enums.Periods [ RowConfig.Period ];
	Object.Description = RowConfig.Description;
	Object.Name = RowConfig.ID;
	if ( Object.IsNew () ) then
		Object.Master = true;
		Object.Company = Company;
		Object.Creator = User;	
		Object.Date = CurrentSessionDate ();
	endif;
	Object.Write ();	

EndProcedure

// *****************************************
// *********** Variables Initialization

Files = new ValueTable ();
columns = Files.Columns;
columns.Add ( "ID" );
columns.Add ( "Type" );
columns.Add ( "Data" );
Files.Indexes.Add ( "ID" );
Remove = "Remove";
Update = "Update";
Template = "Template";
Exporter = "Exporter";
Program = "Program";
Company = Logins.Settings ( "Company" ).Company;
User = SessionParameters.User;

#endif
